ORG/brain/init.el Start of manual config.org
#+BRAIN_FRIENDS: index

#+BRAIN_CHILDREN: inpak.el%20INSTALL%20PACKAGES fin.el%20FIN-MODS%20CUSTOMIZATION hydra-cfg.el%20HYDRA%20MENU%20CUSTOMIZATION

#+BRAIN_PARENTS: .emacs .emacs

#+PROPERTY:    :tangle ~/INI/init.el

;; init.el --- Emacs configuration

Full in org
open it for editing

* Commands
(find-file-other-frame "~/INI/init.el")
(load "~/INI/inpak.el")
(org-babel-tangle)

* Source
#+PROPERTY:    :tangle ~/INI/init.el
** all
*** INSTALL PACKAGES
(find-file-other-frame "~/INI/vanila_cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/inpak.el")
#+end_src
;; --------------------------------------
*** VANILA CUSTOMIZATION
(find-file-other-frame "~/INI/vanila_cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/vanila_cfg.el")
#+end_src
;; --------------------------------------
*** EVIL-MOD CUSTOMIZATION
	[[elisp:(find-file-other-frame "~/INI/evil-mod-cfg.el")]["~/INI/evil-mod-cfg.el"]]
	(find-file-other-frame "~/INI/evil-mod-cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/evil-mod-cfg.el")
#+end_src
;; --------------------------------------
		[[elisp:(find-file-other-frame "~/INI/Evil/evil-tabs-cfg.el")]["~/INI/Evil/evil-tabs-cfg.el"]]
		(find-file-other-frame "~/INI/Evil/evil-tabs-cfg.el")
		[[elisp:(find-file-other-frame "~/ELs/Evil/evil-respect-input.el")]["~/ELs/Evil/evil-respect-input.el"]]
		(find-file-other-frame "~/ELs/Evil/evil-respect-input.el")

	(find-file-other-frame "~/ELs/Evil/onecharadd.el") not used
	(find-file-other-frame "~/ELs/Evil/copylines.el") пока нет
*** WWW CUSTOMIZATION
;; (with-eval-after-load 'evil
;;   (define-key evil-motion-state-map (kbd "g l") 'evil-end-of-line))
;; (eval-after-load "~/INI/www-cfg.el")
;; (find-file-other-frame "~/INI/www-cfg.el") 
;; (find-file-other-frame "~/INI/org_agend_cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(use-package eww
  :config
	(load "~/INI/www-cfg.el"))
#+end_src
;; --------------------------------------
*** INTERFACE-MODS CUSTOMIZATION
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/interface-mods.el")
#+end_src
;; --------------------------------------
*** ORG-MODE CUSTOMIZATION
(find-file-other-frame "~/INI/org-cfg.el")
	(find-file-other-frame "~/INI/ORG/org-roam-cfg.el")
	(find-file-other-frame "~/INI/org_agend_cfg.el")
	(find-file-other-frame "~/INI/babel-cfg.el")
		(find-file-other-frame "~/ELs/Org/Babel/ob-eshell.el")
	(find-file-other-frame "~/INI/org-brain-cfg.el")
	(find-file-other-frame "~/INI/ORG/graph-tools-cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/org-cfg.el")
#+end_src
;; --------------------------------------
*** FIN-MODE CUSTOMIZATION>
[[file:fin.el FIN-MODS CUSTOMIZATION.org::C-c C-v C-t to render ~/INI/FIN/fin.el][fin.el FIN-MODS CUSTOMIZATION.org]]
(find-file-other-frame "~/INI/FIN/fin.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/FIN/fin.el")
#+end_src
;; --------------------------------------
*** FRAME & WINDOWS CONTROL-MODS CUSTOMIZATION
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/frame-control.el")
#+end_src
;; --------------------------------------
*** FOLDING-MODS CUSTOMIZATION
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/folding-cfg.el")
#+end_src
;; --------------------------------------
*** LITERARY-MODS CUSTOMIZATION
;; (find-file "~/INI/lit-cfg.el")
;; (find-file-other-frame "~/INI/lit-cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/lit-cfg.el")
#+end_src
;; --------------------------------------
*** DEVELOPMENT-MODs CUSTOMIZATION
(find-file-other-frame "~/INI/dev-cfg.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/dev-cfg.el")
#+end_src
;; --------------------------------------
	(find-file-other-frame "~/INI/autocomplete-cfg.el")
	(find-file-other-frame "~/INI/snippets-cfg.el")
	(find-file-other-frame "~/INI/delimiters-cfg.el")
	(find-file-other-frame "~/INI/js-cfg.el") 
	(find-file-other-frame "~/INI/lua-cfg.el")
	(find-file-other-frame "~/INI/python-cfg.el")
	(find-file-other-frame "~/INI/dev/csharp-cfg.el")
	(find-file-other-frame "~/INI/dev/clojure-cfg.el")
	(find-file-other-frame "~/INI/dev/autohotkey-cfg.el")
	(find-file-other-frame "~/INI/dev/unity-cfg.el")
	(find-file-other-frame "~/INI/dev/formats-mods-cfg.el")
	(find-file-other-frame "~/INI/c-mode-cfg.el") not used
	(find-file-other-frame "~/INI/flycheck-cfg.el")
*** HYDRA CUSTOMIZATION
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/hydra-cfg.el")
#+end_src
;; --------------------------------------
*** ADVNSED SELECTIONS CUSTOMIZATION
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/INI/advnsed-selections-cfg.el")
#+end_src
;; --------------------------------------
*** LOAD BUYN's ELISP DEFUNS
;; (find-file "~/ELs/BuYn/shell.el")
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(load "~/ELs/BuYn/shell.el")
#+end_src
;; --------------------------------------
*** NOT USED
**** TIME TRACKING-MODs CUSTOMIZATION
#+HEADER: :tangle no
#+begin_src emacs-lisp 
;; (load "~/INI/time-tracking-cfg.el")
#+end_src
;; --------------------------------------
*** END OF LOAD
#+HEADER: :tangle ~/INI/init.el
#+begin_src emacs-lisp 
(message "Load of init.el is ended")
#+end_src
;; --------------------------------------
;; init.el ends here
;; --------------------------------------
#+end_src

